precursor/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//libs	( "mylibfvOptions.so" );
//libs	( "forceCoeffsModified.so" );

libs
(
"petscFoam"
"overset" 
"fvMotionSolvers"
);

#include        "../initialConditions"

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    runTime;

writeInterval   100;

adjustTimeStep  no;


purgeWrite      0;


//- Uncomment to have regular (every 2 hours of run time) restart files
//secondaryWriteControl    cpuTime; // runtime
//secondaryWriteInterval   7200;    // seconds
//secondaryPurgeWrite      1;       // keep all but last dump


writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "functions/readFields"
    #include "functions/residuals"
    #include "functions/forceCoeffs"
    // #include "functions/timeActivatedFileUpdate"
    // #include "functions/forces"
    // #include "functions/meanFields"
    // #include "functions/nearWallFields"
    // #include "functions/wallShearStresses"
    // #include "functions/vorticity"
    // #include "functions/Q"
    // #include "functions/Lambda2"
    #include "functions/yPlus"
    // #include "functions/isoSurfaces"
}

DebugSwitches
{
    processorPolyPatch  0; 
    polyMesh            0;
}

// ************************************************************************* //
