precursor/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1;
xmin -1.5; xmax 8.5;
ymin 0; ymax 0.05;
zmin 0.0; zmax 3;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 60) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    topAndBottom
    {
        type patch;
        faces ( (4 5 6 7) (0 3 2 1) );
    }
    symFront
    {
        type symmetryPlane;
        faces ( (0 1 5 4) );
    }
    symBack
    {
        type symmetryPlane;
        faces ( (3 7 6 2) );
    }
);
