precursor/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
pointSync false;
patches
(
    {
        name front;
        patchInfo { type empty; }
        constructFrom patches;
        patches (symFront);
    }
    {
        name back;
        patchInfo { type empty; }
        constructFrom patches;
        patches (symBack);
    }
);
