precursor/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    RW.obj { type triSurfaceMesh; name RW; }
    F1.obj { type triSurfaceMesh; name F1; }
    F2.obj { type triSurfaceMesh; name F2; }
    // F3.obj { type triSurfaceMesh; name F3; }
    U3.obj { type triSurfaceMesh; name U3; }

    refinementBox
    {
        type searchableBox;
        min (1.2 0.0 0.5); // Leggermente prima del profilo (X: 1.2, Z: 0.5)
        max (2.1 0.1 1.3); // Leggermente dopo e sopra (X: 2.1, Z: 1.3)
    }

    wake
    {
        type searchableBox;
        min (1.2 0.0 0.5); // Inizio zona ali
        max (6.0 0.1 1.5);  // Si estende verso outlet (X=5.0)
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
        { file "RW.eMesh"; level 4; }
        { file "F1.eMesh"; level 4; }
        { file "F2.eMesh"; level 4; }
        { file "U3.eMesh"; level 4; }
    );

    refinementSurfaces
    {
        RW { level (4 5); patchInfo { type wall; } }
        F1 { level (4 5); patchInfo { type wall; } }
        F2 { level (4 5); patchInfo { type wall; } }
        // F3 { level (4 5); patchInfo { type wall; } }
        U3 { level (4 5); patchInfo { type wall; } }
    }



    resolveFeatureAngle 30;

    refinementRegions
    {
            RW 
        { 
            mode distance; 
            levels 
            (  
                (0.01 5)  // vicino alla superficie
                (0.05 3)  // lontano dalla superficie
            );  
        }

        F1 
        { 
            mode distance; 
            levels 
            (  
                (0.01 5)  // vicino alla superficie
                (0.05 3)  // lontano dalla superficie
            );  
        }

        F2 
        { 
            mode distance; 
            levels 
            (  
                (0.01 5)  // vicino alla superficie
                (0.05 3)  // lontano dalla superficie
            );  
        }

        U3 
        { 
            mode distance; 
            levels 
            (  
                (0.01 5)  // vicino alla superficie
                (0.05 3)  // lontano dalla superficie
            );  
        }

        refinementBox
        {
            mode inside;
            levels ( (1.0 3) ); 
        }

        wake
        {
            mode inside;
            levels ( (1.0 2) ); 
        }
    }

    locationInMesh (2.0 0.002 0.05);  // Changed Y from 0 to 25 (middle of thick domain)
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        RW { nSurfaceLayers 6; }
        F1 { nSurfaceLayers 6; }
        F2 { nSurfaceLayers 6; }
        // F3 { nSurfaceLayers 6; }
        U3 { nSurfaceLayers 6; }
    }

    expansionRatio 1.15;
    finalLayerThickness 0.25;
    minThickness 0.01;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxIter 5;
}

meshQualityControls
{
    #include "meshQualityDict"
}

writeFlags
(
    layerSets
    layerFields
);

mergeTolerance 1e-3;
