precursor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       145700;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       145760;
    }
    topAndBottom
    {
        type            patch;
        nFaces          400;
        startFace       145820;
    }
    RW
    {
        type            wall;
        inGroups        1(wall);
        nFaces          848;
        startFace       146220;
    }
    F1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          131;
        startFace       147068;
    }
    F2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          164;
        startFace       147199;
    }
    U3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          145;
        startFace       147363;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          72814;
        startFace       147508;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          72814;
        startFace       220322;
    }
)

// ************************************************************************* //
