precursor/system/functions/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      Q;
}
Q1
{
    // Mandatory entries (unmodifiable)
    type            Q;
    libs            ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           	U;
    result		Q;
    writeControl    	writeTime;
    executeControl   	writeTime;

}
