precursor/system/functions/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      vorticity;
}
vorticity1
{
    // Mandatory entries (unmodifiable)
    type        vorticity;
    libs        ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           	UMean;
    result		vorticity;
    writeControl    	writeTime;
    executeControl   	writeTime;
}
