precursor/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../initialConditions"

surfaces ("RW.obj");

includedAngle   $inclAngle;

subsetFeatures
{
        nonManifoldEdges       no;
        openEdges       yes;
}

//writeObj                yes;
